InformationRegisters/СведенияОДисциплинарныхВзысканиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СведенияОДисциплинарныхВзысканиях</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Взыскание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ДисциплинарноеВзыскание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДисциплинарноеВзыскание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.СведенияОДисциплинарныхВзысканиях</xr:Item>
				<xr:Item>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</xr:Item>
				<xr:Item>InformationRegister.БухучетНачисленийСотрудников</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Взыскание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершитьНаставничество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Взыскание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Наставники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставляемый</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НазначениеНаставника</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтменитьДоплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СовокупнаяТарифнаяСтавка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифнойСтавки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифныхСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СнятиеДисциплинарногоВзыскания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СнятиеДисциплинарногоВзыскания</Name>
			<BasedOn>
				<xr:Item>Document.ДисциплинарноеВзыскание</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОДисциплинарныхВзысканиях</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДисциплинарноеВзыскание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Взыскание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСнятия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ДисциплинарныеВзыскания/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьДвиженияДисциплинарногоВзыскания(Движения, ДвиженияДисциплинарногоВзыскания) Экспорт
	
	Для каждого СтрокаДанных Из ДвиженияДисциплинарногоВзыскания Цикл
		ЗаполнитьЗначенияСвойств(Движения.СведенияОДисциплинарныхВзысканиях.Добавить(), СтрокаДанных);
	КонецЦикла;
	
	Движения.СведенияОДисциплинарныхВзысканиях.Записать();
	Движения.СведенияОДисциплинарныхВзысканиях.Записывать = Ложь;
	
КонецПроцедуры

Процедура ОформлениеНесколькихДокументовДополнитьФорму(Форма) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВведенныеДокументы", Новый ОписаниеТипов("СписокЗначений")));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	Элементы = Форма.Элементы;
	ВведенныеДокументыГруппа = Элементы.ВведенныеДокументыГруппа;
	
	Если Элементы.Найти("НадписьВведенныеДокументы") = Неопределено Тогда
		Элемент = Элементы.Добавить("НадписьВведенныеДокументы", Тип("ДекорацияФормы"), ВведенныеДокументыГруппа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элемент.Заголовок = Новый ФорматированнаяСтрока("");
		Элемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_ОткрытьВведенныеДокументы");
		Элемент.АвтоМаксимальнаяШирина = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьТекстНадписиОДокументахДействующихВзысканий(Форма, Регистратор, СотрудникиВзыскания) Экспорт
	
	ДействующиеДокументы = ДокументыДействующихВзысканий(Регистратор, СотрудникиВзыскания);
	Форма.ВведенныеДокументы.ЗагрузитьЗначения(ДействующиеДокументы);
	
	Если Форма.ВведенныеДокументы.Количество() > 1 Тогда
		
		ТекстНадписиНачало = НСтр("ru = 'На выбранные периоды существуют действующие'") + " ";
		ТекстНадписиГиперссылка = Новый ФорматированнаяСтрока(НСтр("ru = 'взыскания'"), , , , "ссылка");
		ТекстНадписиОкончание = НСтр("ru = 'При заполнении необходимо учитывать эти проведенные ранее документы.'");
		ТекстНадписи = Новый ФорматированнаяСтрока(ТекстНадписиНачало, ТекстНадписиГиперссылка, ". ", ТекстНадписиОкончание);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "НадписьВведенныеДокументы", "Заголовок", ТекстНадписи);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВведенныеДокументы", "Видимость", Истина);
		
	ИначеЕсли Форма.ВведенныеДокументы.Количество() = 1 Тогда
		
		ТекстНадписиНачало = НСтр("ru = 'На выбранные периоды существует действующее'") + " ";
		ТекстНадписиГиперссылка = Новый ФорматированнаяСтрока(НСтр("ru = 'взыскание'"), , , , "ссылка");
		ТекстНадписиОкончание = НСтр("ru = 'При заполнении необходимо учитывать проведенный ранее документ.'");
		ТекстНадписи = Новый ФорматированнаяСтрока(ТекстНадписиНачало, ТекстНадписиГиперссылка, ". ", ТекстНадписиОкончание);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "НадписьВведенныеДокументы", "Заголовок", ТекстНадписи);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВведенныеДокументыГруппа", "Видимость", Истина);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВведенныеДокументыГруппа", "Видимость", Ложь);
	КонецЕсли;
	
КонецПроцедуры

Функция ДокументыДействующихВзысканий(Регистратор, СотрудникиВзыскания)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Документ", Регистратор);
	Запрос.УстановитьПараметр("ИсходныеДанные", СотрудникиВзыскания);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИсходныеДанные.Сотрудник КАК Сотрудник,
		|	ИсходныеДанные.Взыскание КАК Взыскание,
		|	ИсходныеДанные.ДатаНачала КАК Период
		|ПОМЕСТИТЬ ВТИзмеренияДаты
		|ИЗ
		|	&ИсходныеДанные КАК ИсходныеДанные";
	Запрос.Выполнить();
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "Регистратор", "<>", Регистратор);
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних("СведенияОДисциплинарныхВзысканиях", Запрос.МенеджерВременныхТаблиц, Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТИзмеренияДаты", "Сотрудник,Взыскание"), ПараметрыПостроения,"ВТСведенияОДисциплинарныхВзысканиях");
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДисциплинарныхВзысканиях.Регистратор КАК Документ
		|ИЗ
		|	ВТСведенияОДисциплинарныхВзысканиях КАК СведенияОДисциплинарныхВзысканиях
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИзмеренияДаты КАК СотрудникиВзыскания
		|		ПО (СотрудникиВзыскания.Сотрудник = СведенияОДисциплинарныхВзысканиях.Сотрудник)
		|			И (СотрудникиВзыскания.Взыскание = СведенияОДисциплинарныхВзысканиях.Взыскание)
		|ГДЕ
		|	СотрудникиВзыскания.Период >= СведенияОДисциплинарныхВзысканиях.ДатаНачала
		|	И (СведенияОДисциплинарныхВзысканиях.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|	ИЛИ СведенияОДисциплинарныхВзысканиях.ДатаОкончания >= СотрудникиВзыскания.Период)";
		
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("Документ");
	
КонецФункции

// Параметры:
//  Форма - Форма
Процедура ПриСозданииНаСервереФормыСотрудника(Форма) Экспорт

	ГруппаКнопки = Форма.Элементы.Найти("ГруппаДисциплинарныеВзыскания");
	Если ГруппаКнопки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.ЖурналыДокументов.ДисциплинарныеВзысканияСотрудников) Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Команды.Найти("ДисциплинарныеВзыскания") = Неопределено Тогда
		КомандаДисциплинарныеВзыскания = Форма.Команды.Добавить("ДисциплинарныеВзыскания");
		КомандаДисциплинарныеВзыскания.Действие = "Подключаемый_ДисциплинарныеВзыскания";
		КомандаДисциплинарныеВзыскания.Заголовок = НСтр("ru = 'Дисциплинарные взыскания'");
	КонецЕсли;
	
	// Добавляем кнопку
	ЭлементАттестацииСотрудника = Форма.Элементы.Вставить("ДисциплинарныеВзыскания", Тип("КнопкаФормы"), ГруппаКнопки);
	ЭлементАттестацииСотрудника.Вид = ВидКнопкиФормы.Гиперссылка;
	ЭлементАттестацииСотрудника.ИмяКоманды = "ДисциплинарныеВзыскания"; 
	
КонецПроцедуры

// Добавляет команды в подменю "Оформить документ" для справочника "Сотрудники".
// См. СотрудникиФормыРасширенный.ОписаниеМенюВводаНаОсновании.
// 
// Параметры:
// 	ОписаниеМеню
//
Процедура ДобавитьПодменюДисциплинарныеВзыскания(ОписаниеМеню) Экспорт
	
	Если Не ПравоДоступа("Изменение", Метаданные.Документы.ДисциплинарноеВзыскание) Тогда
		Возврат;
	КонецЕсли;
	
	ПунктыМеню = Новый Массив;
	
	ПунктыМеню.Добавить("Документы.ДисциплинарноеВзыскание");
	ПунктыМеню.Добавить("Документы.СнятиеДисциплинарногоВзыскания");
	
	ОписаниеРаздела = СотрудникиФормы.РазделМеню(НСтр("ru='Дисциплинарные взыскания'"), ПунктыМеню);
	ОписаниеМеню.Пункты.Добавить(ОписаниеРаздела);
	
КонецПроцедуры

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.ДисциплинарноеВзыскание, Истина);
	Списки.Вставить(Метаданные.Справочники.ДисциплинарноеВзысканиеПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.СнятиеДисциплинарногоВзыскания, Истина);
	Списки.Вставить(Метаданные.Справочники.СнятиеДисциплинарногоВзысканияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СведенияОДисциплинарныхВзысканиях, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДисциплинарныеВзысканияСотрудников, Истина);	

КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
		|Документ.ДисциплинарноеВзыскание.Чтение.ГруппыФизическихЛиц
		|Документ.ДисциплинарноеВзыскание.Чтение.Организации
		|Документ.ДисциплинарноеВзыскание.Изменение.ГруппыФизическихЛиц
		|Документ.ДисциплинарноеВзыскание.Изменение.Организации
		|Документ.СнятиеДисциплинарногоВзыскания.Чтение.ГруппыФизическихЛиц
		|Документ.СнятиеДисциплинарногоВзыскания.Чтение.Организации
		|Документ.СнятиеДисциплинарногоВзыскания.Изменение.ГруппыФизическихЛиц
		|Документ.СнятиеДисциплинарногоВзыскания.Изменение.Организации
		|Справочник.ДисциплинарноеВзысканиеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.ДисциплинарноеВзысканиеПрисоединенныеФайлы.Чтение.Организации
		|Справочник.ДисциплинарноеВзысканиеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.ДисциплинарноеВзысканиеПрисоединенныеФайлы.Изменение.Организации
		|Справочник.СнятиеДисциплинарногоВзысканияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.СнятиеДисциплинарногоВзысканияПрисоединенныеФайлы.Чтение.Организации
		|Справочник.СнятиеДисциплинарногоВзысканияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.СнятиеДисциплинарногоВзысканияПрисоединенныеФайлы.Изменение.Организации
		|ЖурналДокументов.ДисциплинарныеВзысканияСотрудников.Чтение.ГруппыФизическихЛиц
		|ЖурналДокументов.ДисциплинарныеВзысканияСотрудников.Чтение.Организации
		|РегистрСведений.СведенияОДисциплинарныхВзысканиях.Чтение.ГруппыФизическихЛиц";
		
КонецПроцедуры

#КонецОбласти

#Область Печать

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ДисциплинарноеВзыскание);
	СписокОбъектов.Добавить(Документы.СнятиеДисциплинарногоВзыскания);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиВариантовОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ДисциплинарныеВзыскания);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.28.26";
	Обработчик.Процедура = "Справочники.Взыскания.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Комментарий = НСтр("ru='Начальное заполнение справочника Взыскания.'");
	
КонецПроцедуры

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "0c9578f3-4ba5-4080-836f-ed278d88f72f", Метаданные.Документы.ДисциплинарноеВзыскание);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "3fd514b7-2bf4-42aa-b304-ac88348accd1", Метаданные.Документы.СнятиеДисциплинарногоВзыскания);
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(
		ИсточникиДанных, "Документ.ДисциплинарноеВзыскание", "Дата", "КадровыйУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(
		ИсточникиДанных, "Документ.СнятиеДисциплинарногоВзыскания", "Дата", "КадровыйУчет", "Организация");
	
КонецПроцедуры

#КонецОбласти
